zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKL25Z4/MKL25Z4.xml
        <register>
          <name>C5</name>
          <description>MCG Control 5 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRDIV0</name>
              <description>PLL External Reference Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Divide Factor is 1</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Divide Factor is 2</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Divide Factor is 3</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Divide Factor is 4</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Divide Factor is 5</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Divide Factor is 6</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Divide Factor is 7</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Divide Factor is 8</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>Divide Factor is 9</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>Divide Factor is 10</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Divide Factor is 11</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Divide Factor is 12</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>Divide Factor is 13</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>Divide Factor is 14</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>Divide Factor is 15</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>Divide Factor is 16</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>Divide Factor is 17</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>Divide Factor is 18</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>Divide Factor is 19</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>Divide Factor is 20</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>Divide Factor is 21</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>Divide Factor is 22</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>Divide Factor is 23</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>Divide Factor is 24</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>Divide Factor is 25</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>Divide Factor is 26</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>Divide Factor is 27</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>Divide Factor is 28</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>Divide Factor is 29</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>Divide Factor is 30</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>Divide Factor is 31</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>Divide Factor is 32</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSTEN0</name>
              <description>PLL Stop Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>MCGPLLCLK is disabled in any of the Stop modes.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MCGPLLCLK is enabled if system is in Normal Stop mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLCLKEN0</name>
              <description>PLL Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>MCGPLLCLK is inactive.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MCGPLLCLK is active.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C6</name>
          <description>MCG Control 6 Register</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VDIV0</name>
              <description>VCO 0 Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Multiply Factor is 24</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Multiply Factor is 25</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Multiply Factor is 26</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Multiply Factor is 27</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Multiply Factor is 28</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Multiply Factor is 29</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Multiply Factor is 30</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Multiply Factor is 31</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>Multiply Factor is 32</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>Multiply Factor is 33</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Multiply Factor is 34</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Multiply Factor is 35</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>Multiply Factor is 36</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>Multiply Factor is 37</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>Multiply Factor is 38</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>Multiply Factor is 39</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>Multiply Factor is 40</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>Multiply Factor is 41</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>Multiply Factor is 42</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>Multiply Factor is 43</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>Multiply Factor is 44</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>Multiply Factor is 45</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>Multiply Factor is 46</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>Multiply Factor is 47</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>Multiply Factor is 48</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>Multiply Factor is 49</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>Multiply Factor is 50</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>Multiply Factor is 51</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>Multiply Factor is 52</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>Multiply Factor is 53</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>Multiply Factor is 54</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>Multiply Factor is 55</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CME0</name>
              <description>Clock Monitor Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>External clock monitor is disabled for OSC0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>External clock monitor is enabled for OSC0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLS</name>
              <description>PLL Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FLL is selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PLL is selected (PRDIV 0 need to be programmed to the correct divider to generate a PLL reference clock in the range of 2-4 MHz prior to setting the PLLS bit).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOLIE0</name>
              <description>Loss of Lock Interrrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No interrupt request is generated on loss of lock.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Generate an interrupt request on loss of lock.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
